[Survived] ConditionalExpression
oath-odds/oath-odds/src/index.ts:26:15
     AttackDie,
     diceNumber,
     toAttackResult,
-    (a, b) => a.attack === b.attack && a.kill === b.kill
+    (a, b) => false
   );
 }

[Survived] ConditionalExpression
oath-odds/oath-odds/src/index.ts:26:15
     AttackDie,
     diceNumber,
     toAttackResult,
-    (a, b) => a.attack === b.attack && a.kill === b.kill
+    (a, b) => false && a.kill === b.kill
   );
 }

[Killed] ConditionalExpression
oath-odds/oath-odds/src/index.ts:43:15
     DefenseDie,
     diceNumber,
     toDefenseResult,
-    (a, b) => a.defense === b.defense
+    (a, b) => false
   );
 }

[Killed] ArrowFunction
oath-odds/oath-odds/src/index.ts:43:5
     DefenseDie,
     diceNumber,
     toDefenseResult,
-    (a, b) => a.defense === b.defense
+    () => undefined
   );
 }

[Survived] ConditionalExpression
oath-odds/oath-odds/src/index.ts:148:11
         defendingForceWarbands
       );
 
-      if (acc.length === 0) {
+      if (false) {
         return [
           {
