[Killed] ConditionalExpression
oath-odds/src/math/Fraction.ts:76:7
     this._reduce();
     other._reduce();
     return (
-      this._numerator === other._numerator &&
-      this._denominator === other._denominator
+      true
     );
   }

[Killed] ConditionalExpression
oath-odds/src/math/Fraction.ts:77:7
     other._reduce();
     return (
       this._numerator === other._numerator &&
-      this._denominator === other._denominator
+      true
     );
   }

[Survived] ConditionalExpression
oath-odds/src/math/Fraction.ts:91:9
    */
   private _reduce(): void {
     const div = gcd(this._numerator, this._denominator);
-    if (div) {
+    if (true) {
       this._numerator = this._numerator / div;
       this._denominator = this._denominator / div;
