[Survived] ConditionalExpression
oath-odds/src/math/index.ts:25:11
 
   const grouped = combined.reduce(
     (acc: WithOdds<T[]>[], current: WithOdds<T[]>) => {
-      if (acc.length === 0) {
+      if (false) {
         return [current];
       } else {

[Killed] UnaryOperator
oath-odds/src/math/index.ts:32:32
         const matchingSetIndex = acc.findIndex(({ value }) =>
           arrayEquals(value.sort(), current.value.sort())
         );
-        if (matchingSetIndex > -1) {
+        if (matchingSetIndex > +1) {
           // Update the existing set by adding the odds
           const updatedSet = {

[Survived] ConditionalExpression
oath-odds/src/math/index.ts:69:11
 
   const sameResultsCombined = raw.reduce(
     (acc: WithOdds<R>[], current: WithOdds<R>) => {
-      if (acc.length === 0) {
+      if (false) {
         return [current];
       } else {

[Killed] UnaryOperator
oath-odds/src/math/index.ts:76:35
         const matchingResultIndex = acc.findIndex(({ value }) =>
           resultEqualFn(value, current.value)
         );
-        if (matchingResultIndex > -1) {
+        if (matchingResultIndex > +1) {
           // Update the existing result by adding the odds
           const updatedResult = {
