[Survived] ConditionalExpression
oath-odds/src/oath/index.ts:31:9
           return { ...acc, attack: acc.attack + 1 };
         case AttackDieFace.TWO_SWORDS_AND_SKULL:
           return { ...acc, attack: acc.attack + 2, kill: acc.kill + 1 };
-        default:
-          return acc;
+        default:
       }
     },

[Survived] ConditionalExpression
oath-odds/src/oath/index.ts:68:9
           return { ...acc, defense: acc.defense + 2 };
         case DefenseDieFace.DOUBLE:
           return { ...acc, defense: acc.defense * 2 };
-        default:
-          return acc;
+        default:
       }
     },
