[Survived] EqualityOperator
oath-odds/src/utils/arrays.ts:36:19
     return false;
   }
 
-  for (let i = 0; i < a.length; i++) {
+  for (let i = 0; i <= a.length; i++) {
     if (a[i] !== b[i]) {
       return false;

[Timeout] UpdateOperator
oath-odds/src/utils/arrays.ts:36:33
     return false;
   }
 
-  for (let i = 0; i < a.length; i++) {
+  for (let i = 0; i < a.length; i--) {
     if (a[i] !== b[i]) {
       return false;

[Killed] ConditionalExpression
oath-odds/src/utils/arrays.ts:37:9
   }
 
   for (let i = 0; i < a.length; i++) {
-    if (a[i] !== b[i]) {
+    if (true) {
       return false;
     }

[Killed] LogicalOperator
oath-odds/src/utils/arrays.ts:60:7
  *   A new array with the element replaced.
  */
 export function replace<T>(elems: T[], idx: number, elem: T): T[] {
-  if (idx >= 0 && idx < elems.length) {
+  if (idx >= 0 || idx < elems.length) {
     return [...elems.slice(0, idx), elem, ...elems.slice(idx + 1)];
   } else {

[Killed] ConditionalExpression
oath-odds/src/utils/arrays.ts:60:19
  *   A new array with the element replaced.
  */
 export function replace<T>(elems: T[], idx: number, elem: T): T[] {
-  if (idx >= 0 && idx < elems.length) {
+  if (idx >= 0 && true) {
     return [...elems.slice(0, idx), elem, ...elems.slice(idx + 1)];
   } else {
