[Killed] BlockStatement
oath-odds/oath-odds/src/index.ts:21:67
  * @returns {WithOdds<AttackResult>[]}
  *   All possible results of rolling this number of attack dice.
  */
-function rollAttack(diceNumber: number): WithOdds<AttackResult>[] {
-  return roll(
-    AttackDie,
-    diceNumber,
-    toAttackResult,
-    (a, b) => a.attack === b.attack && a.kill === b.kill
-  );
-}
+function rollAttack(diceNumber: number): WithOdds<AttackResult>[] {}
 
 /**

[Killed] EqualityOperator
oath-odds/oath-odds/src/index.ts:26:15
     AttackDie,
     diceNumber,
     toAttackResult,
-    (a, b) => a.attack === b.attack && a.kill === b.kill
+    (a, b) => a.attack !== b.attack && a.kill === b.kill
   );
 }

[Killed] ConditionalExpression
oath-odds/oath-odds/src/index.ts:26:40
     AttackDie,
     diceNumber,
     toAttackResult,
-    (a, b) => a.attack === b.attack && a.kill === b.kill
+    (a, b) => a.attack === b.attack && true
   );
 }

[Killed] BlockStatement
oath-odds/oath-odds/src/index.ts:38:69
  * @returns {WithOdds<DefenseResult>[]}
  *   All possible results of rolling this number of defense dice.
  */
-function rollDefense(diceNumber: number): WithOdds<DefenseResult>[] {
-  return roll(
-    DefenseDie,
-    diceNumber,
-    toDefenseResult,
-    (a, b) => a.defense === b.defense
-  );
-}
+function rollDefense(diceNumber: number): WithOdds<DefenseResult>[] {}
 
 /**

[Killed] EqualityOperator
oath-odds/oath-odds/src/index.ts:43:15
     DefenseDie,
     diceNumber,
     toDefenseResult,
-    (a, b) => a.defense === b.defense
+    (a, b) => a.defense !== b.defense
   );
 }

[Killed] ConditionalExpression
oath-odds/oath-odds/src/index.ts:43:15
     DefenseDie,
     diceNumber,
     toDefenseResult,
-    (a, b) => a.defense === b.defense
+    (a, b) => true
   );
 }

[Killed] BlockStatement
oath-odds/oath-odds/src/index.ts:60:31
 export function rollCampaign(
   attackDice: number,
   defenseDice: number
-): WithOdds<CampaignResult>[] {
-  const attackRoll = rollAttack(attackDice);
-  const defenseRoll = rollDefense(defenseDice);
-
-  const product = cartesianProduct<any>(attackRoll, defenseRoll);
-
-  return product.map((pair) =>
-    merge(pair as [WithOdds<AttackResult>, WithOdds<DefenseResult>])
-  );
-}
+): WithOdds<CampaignResult>[] {}
 
 function merge(

[Killed] ArrowFunction
oath-odds/oath-odds/src/index.ts:66:22
 
   const product = cartesianProduct<any>(attackRoll, defenseRoll);
 
-  return product.map((pair) =>
-    merge(pair as [WithOdds<AttackResult>, WithOdds<DefenseResult>])
+  return product.map(() => undefined
   );
 }

[Killed] BlockStatement
oath-odds/oath-odds/src/index.ts:73:29
 
 function merge(
   attackDefensePair: [WithOdds<AttackResult>, WithOdds<DefenseResult>]
-): WithOdds<CampaignResult> {
-  const [attack, defense] = attackDefensePair;
-  return {
-    oddsOfValue: attack.oddsOfValue.multiply(defense.oddsOfValue),
-    value: { ...attack.value, ...defense.value },
-  };
-}
+): WithOdds<CampaignResult> {}
 
 /**

[Killed] BlockStatement
oath-odds/oath-odds/src/index.ts:112:18
   result: CampaignResult,
   attackingForceWarbands: number,
   defendingForceWarbands: number
-): number | null {
-  const warbandsAfterKill = attackingForceWarbands - result.kill;
-
-  const attackVsDefense =
-    result.attack - result.defense - defendingForceWarbands;
-
-  if (attackVsDefense > 0) {
-    return warbandsAfterKill;
-  } else {
-    const warbandsToSacrifice = 1 - attackVsDefense;
-    if (warbandsToSacrifice > warbandsAfterKill) {
-      return null;
-    } else {
-      return warbandsAfterKill - warbandsToSacrifice;
-    }
-  }
-}
+): number | null {}
 
 export function computeCampaignSuccess(

[Killed] ArithmeticOperator
oath-odds/oath-odds/src/index.ts:113:29
   attackingForceWarbands: number,
   defendingForceWarbands: number
 ): number | null {
-  const warbandsAfterKill = attackingForceWarbands - result.kill;
+  const warbandsAfterKill = attackingForceWarbands + result.kill;
 
   const attackVsDefense =

[Killed] ArithmeticOperator
oath-odds/oath-odds/src/index.ts:116:5
   const warbandsAfterKill = attackingForceWarbands - result.kill;
 
   const attackVsDefense =
-    result.attack - result.defense - defendingForceWarbands;
+    result.attack - result.defense + defendingForceWarbands;
 
   if (attackVsDefense > 0) {

[Killed] ArithmeticOperator
oath-odds/oath-odds/src/index.ts:116:5
   const warbandsAfterKill = attackingForceWarbands - result.kill;
 
   const attackVsDefense =
-    result.attack - result.defense - defendingForceWarbands;
+    result.attack + result.defense - defendingForceWarbands;
 
   if (attackVsDefense > 0) {

[Killed] BlockStatement
oath-odds/oath-odds/src/index.ts:118:28
   const attackVsDefense =
     result.attack - result.defense - defendingForceWarbands;
 
-  if (attackVsDefense > 0) {
-    return warbandsAfterKill;
-  } else {
+  if (attackVsDefense > 0) {} else {
     const warbandsToSacrifice = 1 - attackVsDefense;
     if (warbandsToSacrifice > warbandsAfterKill) {

[Killed] ConditionalExpression
oath-odds/oath-odds/src/index.ts:118:7
   const attackVsDefense =
     result.attack - result.defense - defendingForceWarbands;
 
-  if (attackVsDefense > 0) {
+  if (false) {
     return warbandsAfterKill;
   } else {

[Killed] BlockStatement
oath-odds/oath-odds/src/index.ts:120:10
 
   if (attackVsDefense > 0) {
     return warbandsAfterKill;
-  } else {
-    const warbandsToSacrifice = 1 - attackVsDefense;
-    if (warbandsToSacrifice > warbandsAfterKill) {
-      return null;
-    } else {
-      return warbandsAfterKill - warbandsToSacrifice;
-    }
-  }
+  } else {}
 }
 

[Killed] ArithmeticOperator
oath-odds/oath-odds/src/index.ts:121:33
   if (attackVsDefense > 0) {
     return warbandsAfterKill;
   } else {
-    const warbandsToSacrifice = 1 - attackVsDefense;
+    const warbandsToSacrifice = 1 + attackVsDefense;
     if (warbandsToSacrifice > warbandsAfterKill) {
       return null;

[Killed] ConditionalExpression
oath-odds/oath-odds/src/index.ts:122:9
     return warbandsAfterKill;
   } else {
     const warbandsToSacrifice = 1 - attackVsDefense;
-    if (warbandsToSacrifice > warbandsAfterKill) {
+    if (true) {
       return null;
     } else {

[Killed] BlockStatement
oath-odds/oath-odds/src/index.ts:122:50
     return warbandsAfterKill;
   } else {
     const warbandsToSacrifice = 1 - attackVsDefense;
-    if (warbandsToSacrifice > warbandsAfterKill) {
-      return null;
-    } else {
+    if (warbandsToSacrifice > warbandsAfterKill) {} else {
       return warbandsAfterKill - warbandsToSacrifice;
     }

[Killed] BlockStatement
oath-odds/oath-odds/src/index.ts:124:12
     const warbandsToSacrifice = 1 - attackVsDefense;
     if (warbandsToSacrifice > warbandsAfterKill) {
       return null;
-    } else {
-      return warbandsAfterKill - warbandsToSacrifice;
-    }
+    } else {}
   }
 }

[Killed] ArithmeticOperator
oath-odds/oath-odds/src/index.ts:125:14
     if (warbandsToSacrifice > warbandsAfterKill) {
       return null;
     } else {
-      return warbandsAfterKill - warbandsToSacrifice;
+      return warbandsAfterKill + warbandsToSacrifice;
     }
   }

[Killed] ArrowFunction
oath-odds/oath-odds/src/index.ts:139:5
   const possibleResults = rollCampaign(attackDice, defenseDice);
 
   const successes = possibleResults.filter(
-    (result) =>
-      remainingWarbandsAfterSacrifice(
-        result.value,
-        attackingForceWarbands,
-        defendingForceWarbands
-      ) !== null
+    () => undefined
   );
 

[Killed] ConditionalExpression
oath-odds/oath-odds/src/index.ts:140:7
 
   const successes = possibleResults.filter(
     (result) =>
-      remainingWarbandsAfterSacrifice(
-        result.value,
-        attackingForceWarbands,
-        defendingForceWarbands
-      ) !== null
+      true
   );
 

[Killed] EqualityOperator
oath-odds/oath-odds/src/index.ts:140:7
 
   const successes = possibleResults.filter(
     (result) =>
-      remainingWarbandsAfterSacrifice(
-        result.value,
-        attackingForceWarbands,
-        defendingForceWarbands
-      ) !== null
+      remainingWarbandsAfterSacrifice(result.value, attackingForceWarbands, defendingForceWarbands) === null
   );
 

[Killed] BlockStatement
oath-odds/oath-odds/src/index.ts:155:29
         defendingForceWarbands
       );
 
-      if (acc.length === 0) {
-        return [
-          {
-            odds: result.oddsOfValue,
-            remainingWarbands,
-          },
-        ];
-      } else {
+      if (acc.length === 0) {} else {
         // Find an equivalent set
         const matchingIndex = acc.findIndex(

[Killed] EqualityOperator
oath-odds/oath-odds/src/index.ts:155:11
         defendingForceWarbands
       );
 
-      if (acc.length === 0) {
+      if (acc.length !== 0) {
         return [
           {

[Killed] BlockStatement
oath-odds/oath-odds/src/index.ts:162:14
             remainingWarbands,
           },
         ];
-      } else {
-        // Find an equivalent set
-        const matchingIndex = acc.findIndex(
-          (item) => item.remainingWarbands === remainingWarbands
-        );
-        if (matchingIndex > -1) {
-          // Update the existing set by adding the odds
-          const updated = {
-            odds: acc[matchingIndex].odds.add(result.oddsOfValue),
-            remainingWarbands: acc[matchingIndex].remainingWarbands,
-          };
-
-          return replace(acc, matchingIndex, updated);
-        } else {
-          // Add the set
-          return [
-            ...acc,
-            {
-              odds: result.oddsOfValue,
-              remainingWarbands,
-            },
-          ];
-        }
-      }
+      } else {}
     },
     []

[Killed] ArrowFunction
oath-odds/oath-odds/src/index.ts:165:11
       } else {
         // Find an equivalent set
         const matchingIndex = acc.findIndex(
-          (item) => item.remainingWarbands === remainingWarbands
+          () => undefined
         );
         if (matchingIndex > -1) {

[Killed] ConditionalExpression
oath-odds/oath-odds/src/index.ts:165:21
       } else {
         // Find an equivalent set
         const matchingIndex = acc.findIndex(
-          (item) => item.remainingWarbands === remainingWarbands
+          (item) => false
         );
         if (matchingIndex > -1) {

[Killed] EqualityOperator
oath-odds/oath-odds/src/index.ts:167:13
         const matchingIndex = acc.findIndex(
           (item) => item.remainingWarbands === remainingWarbands
         );
-        if (matchingIndex > -1) {
+        if (matchingIndex <= -1) {
           // Update the existing set by adding the odds
           const updated = {

[Killed] EqualityOperator
oath-odds/oath-odds/src/index.ts:167:13
         const matchingIndex = acc.findIndex(
           (item) => item.remainingWarbands === remainingWarbands
         );
-        if (matchingIndex > -1) {
+        if (matchingIndex >= -1) {
           // Update the existing set by adding the odds
           const updated = {

[Killed] BlockStatement
oath-odds/oath-odds/src/index.ts:175:16
           };
 
           return replace(acc, matchingIndex, updated);
-        } else {
-          // Add the set
-          return [
-            ...acc,
-            {
-              odds: result.oddsOfValue,
-              remainingWarbands,
-            },
-          ];
-        }
+        } else {}
       }
     },

[Killed] ArrayDeclaration
oath-odds/oath-odds/src/index.ts:177:18
           return replace(acc, matchingIndex, updated);
         } else {
           // Add the set
-          return [
-            ...acc,
-            {
-              odds: result.oddsOfValue,
-              remainingWarbands,
-            },
-          ];
+          return [];
         }
       }

[Killed] ObjectLiteral
oath-odds/oath-odds/src/index.ts:179:13
           // Add the set
           return [
             ...acc,
-            {
-              odds: result.oddsOfValue,
-              remainingWarbands,
-            },
+            {},
           ];
         }

[Killed] ArrowFunction
oath-odds/oath-odds/src/index.ts:190:42
     []
   );
 
-  return groupedByRemainingWarbands.sort((a, b) =>
-    a.remainingWarbands < b.remainingWarbands
-      ? -1
-      : a.remainingWarbands > b.remainingWarbands
-      ? 1
-      : 0
+  return groupedByRemainingWarbands.sort(() => undefined
   );
 }

[Killed] EqualityOperator
oath-odds/oath-odds/src/index.ts:191:5
   );
 
   return groupedByRemainingWarbands.sort((a, b) =>
-    a.remainingWarbands < b.remainingWarbands
+    a.remainingWarbands >= b.remainingWarbands
       ? -1
       : a.remainingWarbands > b.remainingWarbands

[Killed] ConditionalExpression
oath-odds/oath-odds/src/index.ts:191:5
   );
 
   return groupedByRemainingWarbands.sort((a, b) =>
-    a.remainingWarbands < b.remainingWarbands
+    true
       ? -1
       : a.remainingWarbands > b.remainingWarbands

[Killed] UnaryOperator
oath-odds/oath-odds/src/index.ts:192:9
 
   return groupedByRemainingWarbands.sort((a, b) =>
     a.remainingWarbands < b.remainingWarbands
-      ? -1
+      ? +1
       : a.remainingWarbands > b.remainingWarbands
       ? 1

[Survived] ConditionalExpression
oath-odds/oath-odds/src/index.ts:193:9
   return groupedByRemainingWarbands.sort((a, b) =>
     a.remainingWarbands < b.remainingWarbands
       ? -1
-      : a.remainingWarbands > b.remainingWarbands
+      : false
       ? 1
       : 0

[Survived] EqualityOperator
oath-odds/oath-odds/src/index.ts:193:9
   return groupedByRemainingWarbands.sort((a, b) =>
     a.remainingWarbands < b.remainingWarbands
       ? -1
-      : a.remainingWarbands > b.remainingWarbands
+      : a.remainingWarbands <= b.remainingWarbands
       ? 1
       : 0
