[Killed] BlockStatement
oath-odds/src/math/Fraction.ts:17:55
    * @param {number} denominator
    *   The denominator of this fraction.
    */
-  constructor(numerator: number, denominator: number) {
-    this._numerator = numerator;
-    this._denominator = denominator;
-    this._reduce();
-  }
+  constructor(numerator: number, denominator: number) {}
 
   /**

[Killed] BlockStatement
oath-odds/src/math/Fraction.ts:31:41
    * @return {Fraction}
    *   A new fraction obtained by adding the 2 fractions.
    */
-  public add(other: Fraction): Fraction {
-    return new Fraction(
-      this._numerator * other._denominator +
-        other._numerator * this._denominator,
-      this._denominator * other._denominator
-    );
-  }
+  public add(other: Fraction): Fraction {}
 
   /**

[Killed] ArithmeticOperator
oath-odds/src/math/Fraction.ts:33:7
    */
   public add(other: Fraction): Fraction {
     return new Fraction(
-      this._numerator * other._denominator +
-        other._numerator * this._denominator,
+      this._numerator * other._denominator - other._numerator * this._denominator,
       this._denominator * other._denominator
     );

[Killed] ArithmeticOperator
oath-odds/src/math/Fraction.ts:33:7
    */
   public add(other: Fraction): Fraction {
     return new Fraction(
-      this._numerator * other._denominator +
+      this._numerator / other._denominator +
         other._numerator * this._denominator,
       this._denominator * other._denominator

[Killed] ArithmeticOperator
oath-odds/src/math/Fraction.ts:34:9
   public add(other: Fraction): Fraction {
     return new Fraction(
       this._numerator * other._denominator +
-        other._numerator * this._denominator,
+        other._numerator / this._denominator,
       this._denominator * other._denominator
     );

[Killed] ArithmeticOperator
oath-odds/src/math/Fraction.ts:35:7
     return new Fraction(
       this._numerator * other._denominator +
         other._numerator * this._denominator,
-      this._denominator * other._denominator
+      this._denominator / other._denominator
     );
   }

[Killed] BlockStatement
oath-odds/src/math/Fraction.ts:47:46
    * @return {Fraction}
    *   A new fraction obtained by multiplying the 2 fractions.
    */
-  public multiply(other: Fraction): Fraction {
-    return new Fraction(
-      this._numerator * other._numerator,
-      this._denominator * other._denominator
-    );
-  }
+  public multiply(other: Fraction): Fraction {}
 
   /**

[Killed] ArithmeticOperator
oath-odds/src/math/Fraction.ts:49:7
    */
   public multiply(other: Fraction): Fraction {
     return new Fraction(
-      this._numerator * other._numerator,
+      this._numerator / other._numerator,
       this._denominator * other._denominator
     );

[Killed] ArithmeticOperator
oath-odds/src/math/Fraction.ts:50:7
   public multiply(other: Fraction): Fraction {
     return new Fraction(
       this._numerator * other._numerator,
-      this._denominator * other._denominator
+      this._denominator / other._denominator
     );
   }

[Killed] BlockStatement
oath-odds/src/math/Fraction.ts:60:28
    * @return {number}
    *   The number value of this fraction
    */
-  public valueOf(): number {
-    return this._numerator / this._denominator;
-  }
+  public valueOf(): number {}
 
   /**

[Killed] ArithmeticOperator
oath-odds/src/math/Fraction.ts:61:12
    *   The number value of this fraction
    */
   public valueOf(): number {
-    return this._numerator / this._denominator;
+    return this._numerator * this._denominator;
   }
 

[Killed] BlockStatement
oath-odds/src/math/Fraction.ts:72:43
    * @return {boolean}
    *   `true` if the 2 fractions are equal, `false` else.
    */
-  public sameAs(other: Fraction): boolean {
-    this._reduce();
-    other._reduce();
-    return (
-      this._numerator === other._numerator &&
-      this._denominator === other._denominator
-    );
-  }
+  public sameAs(other: Fraction): boolean {}
 
   public toString(): string {

[Killed] LogicalOperator
oath-odds/src/math/Fraction.ts:76:7
     this._reduce();
     other._reduce();
     return (
-      this._numerator === other._numerator &&
-      this._denominator === other._denominator
+      this._numerator === other._numerator || this._denominator === other._denominator
     );
   }

[Killed] EqualityOperator
oath-odds/src/math/Fraction.ts:76:7
     this._reduce();
     other._reduce();
     return (
-      this._numerator === other._numerator &&
+      this._numerator !== other._numerator &&
       this._denominator === other._denominator
     );

[Killed] ConditionalExpression
oath-odds/src/math/Fraction.ts:77:7
     other._reduce();
     return (
       this._numerator === other._numerator &&
-      this._denominator === other._denominator
+      false
     );
   }

[Killed] EqualityOperator
oath-odds/src/math/Fraction.ts:77:7
     other._reduce();
     return (
       this._numerator === other._numerator &&
-      this._denominator === other._denominator
+      this._denominator !== other._denominator
     );
   }

[Survived] BlockStatement
oath-odds/src/math/Fraction.ts:81:29
     );
   }
 
-  public toString(): string {
-    return `${this._numerator} / ${this._denominator}`;
-  }
+  public toString(): string {}
 
   /**

[Killed] BlockStatement
oath-odds/src/math/Fraction.ts:89:27
    * Reduce the fraction using the greatest common divider of the numerator
    * and the denominator.
    */
-  private _reduce(): void {
-    const div = gcd(this._numerator, this._denominator);
-    if (div) {
-      this._numerator = this._numerator / div;
-      this._denominator = this._denominator / div;
-    }
-  }
+  private _reduce(): void {}
 }
 

[Killed] ConditionalExpression
oath-odds/src/math/Fraction.ts:91:9
    */
   private _reduce(): void {
     const div = gcd(this._numerator, this._denominator);
-    if (div) {
+    if (false) {
       this._numerator = this._numerator / div;
       this._denominator = this._denominator / div;

[Killed] BlockStatement
oath-odds/src/math/Fraction.ts:91:14
    */
   private _reduce(): void {
     const div = gcd(this._numerator, this._denominator);
-    if (div) {
-      this._numerator = this._numerator / div;
-      this._denominator = this._denominator / div;
-    }
+    if (div) {}
   }
 }

[Killed] ArithmeticOperator
oath-odds/src/math/Fraction.ts:92:25
   private _reduce(): void {
     const div = gcd(this._numerator, this._denominator);
     if (div) {
-      this._numerator = this._numerator / div;
+      this._numerator = this._numerator * div;
       this._denominator = this._denominator / div;
     }

[Killed] ArithmeticOperator
oath-odds/src/math/Fraction.ts:93:27
     const div = gcd(this._numerator, this._denominator);
     if (div) {
       this._numerator = this._numerator / div;
-      this._denominator = this._denominator / div;
+      this._denominator = this._denominator * div;
     }
   }

[Killed] BlockStatement
oath-odds/src/math/Fraction.ts:108:44
  * @returns {number}
  *   Greatest common divider of `a` and `b`.
  */
-function gcd(a: number, b: number): number {
-  if (b > a) {
-    return gcd(b, a);
-  }
-
-  if (b === 0) {
-    return a;
-  } else {
-    return gcd(b, a % b);
-  }
-}
+function gcd(a: number, b: number): number {}
 

[Survived] ConditionalExpression
oath-odds/src/math/Fraction.ts:109:7
  *   Greatest common divider of `a` and `b`.
  */
 function gcd(a: number, b: number): number {
-  if (b > a) {
+  if (false) {
     return gcd(b, a);
   }

[Survived] BlockStatement
oath-odds/src/math/Fraction.ts:109:14
  *   Greatest common divider of `a` and `b`.
  */
 function gcd(a: number, b: number): number {
-  if (b > a) {
-    return gcd(b, a);
-  }
+  if (b > a) {}
 
   if (b === 0) {

[Killed] EqualityOperator
oath-odds/src/math/Fraction.ts:113:7
     return gcd(b, a);
   }
 
-  if (b === 0) {
+  if (b !== 0) {
     return a;
   } else {

[Killed] ConditionalExpression
oath-odds/src/math/Fraction.ts:113:7
     return gcd(b, a);
   }
 
-  if (b === 0) {
+  if (true) {
     return a;
   } else {

[Killed] BlockStatement
oath-odds/src/math/Fraction.ts:115:10
 
   if (b === 0) {
     return a;
-  } else {
-    return gcd(b, a % b);
-  }
+  } else {}
 }
 
