[Killed] BlockStatement
oath-odds/src/math/RandomDevice.ts:32:69
    * @param {ReadonlyArray<[Outcome, Fraction]>} outcomesWithOdds
    *   An array of (outcome, odds) pairs.
    */
-  constructor(outcomesWithOdds: ReadonlyArray<[Outcome, Fraction]>) {
-    for (const elem of outcomesWithOdds) {
-      this._outcomesWithOdds.push({
-        oddsOfValue: elem[1],
-        value: [elem[0]],
-      });
-    }
-  }
+  constructor(outcomesWithOdds: ReadonlyArray<[Outcome, Fraction]>) {}
 
   /**

[Killed] BlockStatement
oath-odds/src/math/RandomDevice.ts:33:42
    *   An array of (outcome, odds) pairs.
    */
   constructor(outcomesWithOdds: ReadonlyArray<[Outcome, Fraction]>) {
-    for (const elem of outcomesWithOdds) {
-      this._outcomesWithOdds.push({
-        oddsOfValue: elem[1],
-        value: [elem[0]],
-      });
-    }
+    for (const elem of outcomesWithOdds) {}
   }
 

[Killed] ArrayDeclaration
oath-odds/src/math/RandomDevice.ts:36:16
     for (const elem of outcomesWithOdds) {
       this._outcomesWithOdds.push({
         oddsOfValue: elem[1],
-        value: [elem[0]],
+        value: [],
       });
     }

[Killed] BlockStatement
oath-odds/src/math/RandomDevice.ts:48:55
    *   The possible outcomes (as sets) this random device can generate along
    * with the odds of each outcome.
    */
-  public getOutcomesWithOdds(): WithOdds<Outcome[]>[] {
-    return this._outcomesWithOdds;
-  }
+  public getOutcomesWithOdds(): WithOdds<Outcome[]>[] {}
 }
 
