[Killed] BlockStatement
oath-odds/src/math/combinatorics.ts:17:60
  * @returns {T[][]}
  *   The cartesian product of all provided sets.
  */
-export function cartesianProduct<T>(...sets: T[][]): T[][] {
-  return sets.reduce(
-    (acc: T[][], set: T[]) => {
-      return flatten(
-        acc.map((x: T[]) => {
-          return set.map((y: T) => {
-            return [...x, y];
-          });
-        })
-      );
-    },
-    [[]] as T[][]
-  );
-}
+export function cartesianProduct<T>(...sets: T[][]): T[][] {}
 

[Killed] BlockStatement
oath-odds/src/math/combinatorics.ts:19:31
  */
 export function cartesianProduct<T>(...sets: T[][]): T[][] {
   return sets.reduce(
-    (acc: T[][], set: T[]) => {
-      return flatten(
-        acc.map((x: T[]) => {
-          return set.map((y: T) => {
-            return [...x, y];
-          });
-        })
-      );
-    },
+    (acc: T[][], set: T[]) => {},
     [[]] as T[][]
   );

[Killed] BlockStatement
oath-odds/src/math/combinatorics.ts:21:29
   return sets.reduce(
     (acc: T[][], set: T[]) => {
       return flatten(
-        acc.map((x: T[]) => {
-          return set.map((y: T) => {
-            return [...x, y];
-          });
-        })
+        acc.map((x: T[]) => {})
       );
     },

[Killed] BlockStatement
oath-odds/src/math/combinatorics.ts:22:36
     (acc: T[][], set: T[]) => {
       return flatten(
         acc.map((x: T[]) => {
-          return set.map((y: T) => {
-            return [...x, y];
-          });
+          return set.map((y: T) => {});
         })
       );

[Killed] ArrayDeclaration
oath-odds/src/math/combinatorics.ts:23:20
       return flatten(
         acc.map((x: T[]) => {
           return set.map((y: T) => {
-            return [...x, y];
+            return [];
           });
         })
