[Killed] ArrowFunction
oath-odds/src/math/index.ts:18:20
  */
 export function odds<T>(devices: RandomDevice<T>[]): WithOdds<T[]>[] {
   const product = cartesianProduct(
-    ...devices.map((d) => d.getOutcomesWithOdds())
+    ...devices.map(() => undefined)
   );
 

[Killed] ArrowFunction
oath-odds/src/math/index.ts:21:32
     ...devices.map((d) => d.getOutcomesWithOdds())
   );
 
-  const combined = product.map((sets) => sets.reduce(combineSetWithOdds));
+  const combined = product.map(() => undefined);
 
   const grouped = combined.reduce(

[Killed] BlockStatement
oath-odds/src/math/index.ts:24:55
   const combined = product.map((sets) => sets.reduce(combineSetWithOdds));
 
   const grouped = combined.reduce(
-    (acc: WithOdds<T[]>[], current: WithOdds<T[]>) => {
-      if (acc.length === 0) {
-        return [current];
-      } else {
-        // Find an equivalent set
-        const matchingSetIndex = acc.findIndex(({ value }) =>
-          arrayEquals(value.sort(), current.value.sort())
-        );
-        if (matchingSetIndex > -1) {
-          // Update the existing set by adding the odds
-          const updatedSet = {
-            oddsOfValue: acc[matchingSetIndex].oddsOfValue.add(
-              current.oddsOfValue
-            ),
-            value: acc[matchingSetIndex].value,
-          };
-
-          return replace(acc, matchingSetIndex, updatedSet);
-        } else {
-          // Add the set
-          return [...acc, current];
-        }
-      }
-    },
+    (acc: WithOdds<T[]>[], current: WithOdds<T[]>) => {},
     []
   );

[Killed] ConditionalExpression
oath-odds/src/math/index.ts:25:11
 
   const grouped = combined.reduce(
     (acc: WithOdds<T[]>[], current: WithOdds<T[]>) => {
-      if (acc.length === 0) {
+      if (true) {
         return [current];
       } else {

[Killed] BlockStatement
oath-odds/src/math/index.ts:25:29
 
   const grouped = combined.reduce(
     (acc: WithOdds<T[]>[], current: WithOdds<T[]>) => {
-      if (acc.length === 0) {
-        return [current];
-      } else {
+      if (acc.length === 0) {} else {
         // Find an equivalent set
         const matchingSetIndex = acc.findIndex(({ value }) =>

[Killed] BlockStatement
oath-odds/src/math/index.ts:27:14
     (acc: WithOdds<T[]>[], current: WithOdds<T[]>) => {
       if (acc.length === 0) {
         return [current];
-      } else {
-        // Find an equivalent set
-        const matchingSetIndex = acc.findIndex(({ value }) =>
-          arrayEquals(value.sort(), current.value.sort())
-        );
-        if (matchingSetIndex > -1) {
-          // Update the existing set by adding the odds
-          const updatedSet = {
-            oddsOfValue: acc[matchingSetIndex].oddsOfValue.add(
-              current.oddsOfValue
-            ),
-            value: acc[matchingSetIndex].value,
-          };
-
-          return replace(acc, matchingSetIndex, updatedSet);
-        } else {
-          // Add the set
-          return [...acc, current];
-        }
-      }
+      } else {}
     },
     []

[Killed] ArrowFunction
oath-odds/src/math/index.ts:29:48
         return [current];
       } else {
         // Find an equivalent set
-        const matchingSetIndex = acc.findIndex(({ value }) =>
-          arrayEquals(value.sort(), current.value.sort())
+        const matchingSetIndex = acc.findIndex(() => undefined
         );
         if (matchingSetIndex > -1) {

[Killed] EqualityOperator
oath-odds/src/math/index.ts:32:13
         const matchingSetIndex = acc.findIndex(({ value }) =>
           arrayEquals(value.sort(), current.value.sort())
         );
-        if (matchingSetIndex > -1) {
+        if (matchingSetIndex <= -1) {
           // Update the existing set by adding the odds
           const updatedSet = {

[Killed] ConditionalExpression
oath-odds/src/math/index.ts:32:13
         const matchingSetIndex = acc.findIndex(({ value }) =>
           arrayEquals(value.sort(), current.value.sort())
         );
-        if (matchingSetIndex > -1) {
+        if (false) {
           // Update the existing set by adding the odds
           const updatedSet = {

[Killed] BlockStatement
oath-odds/src/math/index.ts:42:16
           };
 
           return replace(acc, matchingSetIndex, updatedSet);
-        } else {
-          // Add the set
-          return [...acc, current];
-        }
+        } else {}
       }
     },

[Killed] ArrowFunction
oath-odds/src/math/index.ts:62:10
 ): WithOdds<R>[] {
   const raw: WithOdds<R>[] = odds<O>([
     ...Array(numberOfDevices).fill(device),
-  ]).map(({ value, oddsOfValue }) => ({
-    oddsOfValue,
-    value: resultTransformationFn(value),
-  }));
+  ]).map(() => undefined);
 
   const sameResultsCombined = raw.reduce(

[Killed] ObjectLiteral
oath-odds/src/math/index.ts:62:39
 ): WithOdds<R>[] {
   const raw: WithOdds<R>[] = odds<O>([
     ...Array(numberOfDevices).fill(device),
-  ]).map(({ value, oddsOfValue }) => ({
-    oddsOfValue,
-    value: resultTransformationFn(value),
-  }));
+  ]).map(({ value, oddsOfValue }) => ({}));
 
   const sameResultsCombined = raw.reduce(

[Killed] BlockStatement
oath-odds/src/math/index.ts:68:51
   }));
 
   const sameResultsCombined = raw.reduce(
-    (acc: WithOdds<R>[], current: WithOdds<R>) => {
-      if (acc.length === 0) {
-        return [current];
-      } else {
-        // Find an equivalent result
-        const matchingResultIndex = acc.findIndex(({ value }) =>
-          resultEqualFn(value, current.value)
-        );
-        if (matchingResultIndex > -1) {
-          // Update the existing result by adding the odds
-          const updatedResult = {
-            oddsOfValue: acc[matchingResultIndex].oddsOfValue.add(
-              current.oddsOfValue
-            ),
-            value: acc[matchingResultIndex].value,
-          };
-
-          return replace(acc, matchingResultIndex, updatedResult);
-        } else {
-          // Add the set
-          return [...acc, current];
-        }
-      }
-    },
+    (acc: WithOdds<R>[], current: WithOdds<R>) => {},
     []
   );

[Killed] EqualityOperator
oath-odds/src/math/index.ts:69:11
 
   const sameResultsCombined = raw.reduce(
     (acc: WithOdds<R>[], current: WithOdds<R>) => {
-      if (acc.length === 0) {
+      if (acc.length !== 0) {
         return [current];
       } else {

[Killed] ConditionalExpression
oath-odds/src/math/index.ts:69:11
 
   const sameResultsCombined = raw.reduce(
     (acc: WithOdds<R>[], current: WithOdds<R>) => {
-      if (acc.length === 0) {
+      if (true) {
         return [current];
       } else {

[Killed] BlockStatement
oath-odds/src/math/index.ts:71:14
     (acc: WithOdds<R>[], current: WithOdds<R>) => {
       if (acc.length === 0) {
         return [current];
-      } else {
-        // Find an equivalent result
-        const matchingResultIndex = acc.findIndex(({ value }) =>
-          resultEqualFn(value, current.value)
-        );
-        if (matchingResultIndex > -1) {
-          // Update the existing result by adding the odds
-          const updatedResult = {
-            oddsOfValue: acc[matchingResultIndex].oddsOfValue.add(
-              current.oddsOfValue
-            ),
-            value: acc[matchingResultIndex].value,
-          };
-
-          return replace(acc, matchingResultIndex, updatedResult);
-        } else {
-          // Add the set
-          return [...acc, current];
-        }
-      }
+      } else {}
     },
     []

[Killed] ArrowFunction
oath-odds/src/math/index.ts:73:51
         return [current];
       } else {
         // Find an equivalent result
-        const matchingResultIndex = acc.findIndex(({ value }) =>
-          resultEqualFn(value, current.value)
+        const matchingResultIndex = acc.findIndex(() => undefined
         );
         if (matchingResultIndex > -1) {

[Killed] ConditionalExpression
oath-odds/src/math/index.ts:76:13
         const matchingResultIndex = acc.findIndex(({ value }) =>
           resultEqualFn(value, current.value)
         );
-        if (matchingResultIndex > -1) {
+        if (false) {
           // Update the existing result by adding the odds
           const updatedResult = {

[Killed] ConditionalExpression
oath-odds/src/math/index.ts:76:13
         const matchingResultIndex = acc.findIndex(({ value }) =>
           resultEqualFn(value, current.value)
         );
-        if (matchingResultIndex > -1) {
+        if (true) {
           // Update the existing result by adding the odds
           const updatedResult = {

[Killed] BlockStatement
oath-odds/src/math/index.ts:86:16
           };
 
           return replace(acc, matchingResultIndex, updatedResult);
-        } else {
-          // Add the set
-          return [...acc, current];
-        }
+        } else {}
       }
     },

[Killed] BlockStatement
oath-odds/src/math/index.ts:116:24
 export function combineSetWithOdds<O, P>(
   first: WithOdds<O[]>,
   second: WithOdds<P[]>
-): WithOdds<(O | P)[]> {
-  return {
-    oddsOfValue: first.oddsOfValue.multiply(second.oddsOfValue),
-    value: [...first.value, ...second.value],
-  };
-}
+): WithOdds<(O | P)[]> {}
 
 export * from "./combinatorics";

[Killed] ObjectLiteral
oath-odds/src/math/index.ts:117:10
   first: WithOdds<O[]>,
   second: WithOdds<P[]>
 ): WithOdds<(O | P)[]> {
-  return {
-    oddsOfValue: first.oddsOfValue.multiply(second.oddsOfValue),
-    value: [...first.value, ...second.value],
-  };
+  return {};
 }
 
