[Killed] BlockStatement
oath-odds/src/oath/CampaignResult.ts:41:11
 export function campaignResultCompareFn(
   a: CampaignResult,
   b: CampaignResult
-): number {
-  const attackCompareDesc =
-    a.attack > b.attack ? -1 : a.attack < b.attack ? 1 : 0;
-  const defenseCompareAsc =
-    a.defense < b.defense ? -1 : a.defense > b.defense ? 1 : 0;
-  const killCompareAsc = a.kill < b.kill ? -1 : a.kill > b.kill ? 1 : 0;
-
-  if (attackCompareDesc !== 0) {
-    return attackCompareDesc;
-  } else {
-    if (defenseCompareAsc !== 0) {
-      return defenseCompareAsc;
-    } else {
-      return killCompareAsc;
-    }
-  }
-}
+): number {}
 

[Killed] EqualityOperator
oath-odds/src/oath/CampaignResult.ts:43:5
   b: CampaignResult
 ): number {
   const attackCompareDesc =
-    a.attack > b.attack ? -1 : a.attack < b.attack ? 1 : 0;
+    a.attack >= b.attack ? -1 : a.attack < b.attack ? 1 : 0;
   const defenseCompareAsc =
     a.defense < b.defense ? -1 : a.defense > b.defense ? 1 : 0;

[Killed] ConditionalExpression
oath-odds/src/oath/CampaignResult.ts:43:32
   b: CampaignResult
 ): number {
   const attackCompareDesc =
-    a.attack > b.attack ? -1 : a.attack < b.attack ? 1 : 0;
+    a.attack > b.attack ? -1 : false ? 1 : 0;
   const defenseCompareAsc =
     a.defense < b.defense ? -1 : a.defense > b.defense ? 1 : 0;

[Killed] ConditionalExpression
oath-odds/src/oath/CampaignResult.ts:45:34
   const attackCompareDesc =
     a.attack > b.attack ? -1 : a.attack < b.attack ? 1 : 0;
   const defenseCompareAsc =
-    a.defense < b.defense ? -1 : a.defense > b.defense ? 1 : 0;
+    a.defense < b.defense ? -1 : true ? 1 : 0;
   const killCompareAsc = a.kill < b.kill ? -1 : a.kill > b.kill ? 1 : 0;
 

[Killed] EqualityOperator
oath-odds/src/oath/CampaignResult.ts:45:34
   const attackCompareDesc =
     a.attack > b.attack ? -1 : a.attack < b.attack ? 1 : 0;
   const defenseCompareAsc =
-    a.defense < b.defense ? -1 : a.defense > b.defense ? 1 : 0;
+    a.defense < b.defense ? -1 : a.defense >= b.defense ? 1 : 0;
   const killCompareAsc = a.kill < b.kill ? -1 : a.kill > b.kill ? 1 : 0;
 

[Killed] EqualityOperator
oath-odds/src/oath/CampaignResult.ts:46:49
     a.attack > b.attack ? -1 : a.attack < b.attack ? 1 : 0;
   const defenseCompareAsc =
     a.defense < b.defense ? -1 : a.defense > b.defense ? 1 : 0;
-  const killCompareAsc = a.kill < b.kill ? -1 : a.kill > b.kill ? 1 : 0;
+  const killCompareAsc = a.kill < b.kill ? -1 : a.kill <= b.kill ? 1 : 0;
 
   if (attackCompareDesc !== 0) {

[Killed] EqualityOperator
oath-odds/src/oath/CampaignResult.ts:46:49
     a.attack > b.attack ? -1 : a.attack < b.attack ? 1 : 0;
   const defenseCompareAsc =
     a.defense < b.defense ? -1 : a.defense > b.defense ? 1 : 0;
-  const killCompareAsc = a.kill < b.kill ? -1 : a.kill > b.kill ? 1 : 0;
+  const killCompareAsc = a.kill < b.kill ? -1 : a.kill >= b.kill ? 1 : 0;
 
   if (attackCompareDesc !== 0) {

[Killed] ConditionalExpression
oath-odds/src/oath/CampaignResult.ts:48:7
     a.defense < b.defense ? -1 : a.defense > b.defense ? 1 : 0;
   const killCompareAsc = a.kill < b.kill ? -1 : a.kill > b.kill ? 1 : 0;
 
-  if (attackCompareDesc !== 0) {
+  if (false) {
     return attackCompareDesc;
   } else {

[Killed] BlockStatement
oath-odds/src/oath/CampaignResult.ts:48:32
     a.defense < b.defense ? -1 : a.defense > b.defense ? 1 : 0;
   const killCompareAsc = a.kill < b.kill ? -1 : a.kill > b.kill ? 1 : 0;
 
-  if (attackCompareDesc !== 0) {
-    return attackCompareDesc;
-  } else {
+  if (attackCompareDesc !== 0) {} else {
     if (defenseCompareAsc !== 0) {
       return defenseCompareAsc;

[Killed] BlockStatement
oath-odds/src/oath/CampaignResult.ts:50:10
 
   if (attackCompareDesc !== 0) {
     return attackCompareDesc;
-  } else {
-    if (defenseCompareAsc !== 0) {
-      return defenseCompareAsc;
-    } else {
-      return killCompareAsc;
-    }
-  }
+  } else {}
 }
 

[Killed] ConditionalExpression
oath-odds/src/oath/CampaignResult.ts:51:9
   if (attackCompareDesc !== 0) {
     return attackCompareDesc;
   } else {
-    if (defenseCompareAsc !== 0) {
+    if (false) {
       return defenseCompareAsc;
     } else {

[Killed] BlockStatement
oath-odds/src/oath/CampaignResult.ts:51:34
   if (attackCompareDesc !== 0) {
     return attackCompareDesc;
   } else {
-    if (defenseCompareAsc !== 0) {
-      return defenseCompareAsc;
-    } else {
+    if (defenseCompareAsc !== 0) {} else {
       return killCompareAsc;
     }

[Killed] BlockStatement
oath-odds/src/oath/CampaignResult.ts:53:12
   } else {
     if (defenseCompareAsc !== 0) {
       return defenseCompareAsc;
-    } else {
-      return killCompareAsc;
-    }
+    } else {}
   }
 }
