[Killed] ArrayDeclaration
oath-odds/src/oath/index.ts:7:58
 import { DefenseDieFace } from "./DefenseDieFace";
 
 /** The Oath attack (red) die. */
-export const AttackDie = new RandomDevice<AttackDieFace>([
-  [AttackDieFace.HOLLOW_SWORD, new Fraction(3, 6)],
-  [AttackDieFace.SWORD, new Fraction(2, 6)],
-  [AttackDieFace.TWO_SWORDS_AND_SKULL, new Fraction(1, 6)],
-]);
+export const AttackDie = new RandomDevice<AttackDieFace>([]);
 
 /**

[Killed] ArrayDeclaration
oath-odds/src/oath/index.ts:8:3
 
 /** The Oath attack (red) die. */
 export const AttackDie = new RandomDevice<AttackDieFace>([
-  [AttackDieFace.HOLLOW_SWORD, new Fraction(3, 6)],
+  [],
   [AttackDieFace.SWORD, new Fraction(2, 6)],
   [AttackDieFace.TWO_SWORDS_AND_SKULL, new Fraction(1, 6)],

[Killed] ArrayDeclaration
oath-odds/src/oath/index.ts:9:3
 /** The Oath attack (red) die. */
 export const AttackDie = new RandomDevice<AttackDieFace>([
   [AttackDieFace.HOLLOW_SWORD, new Fraction(3, 6)],
-  [AttackDieFace.SWORD, new Fraction(2, 6)],
+  [],
   [AttackDieFace.TWO_SWORDS_AND_SKULL, new Fraction(1, 6)],
 ]);

[Killed] BlockStatement
oath-odds/src/oath/index.ts:21:70
  * @returns {CampaignResult}
  *   The attack roll result after adding all die faces.
  */
-export function toAttackResult(faces: AttackDieFace[]): AttackResult {
-  const raw = faces.sort().reduce(
-    (acc: AttackResult, face: AttackDieFace) => {
-      switch (face) {
-        case AttackDieFace.HOLLOW_SWORD:
-          return { ...acc, attack: acc.attack + 0.5 };
-        case AttackDieFace.SWORD:
-          return { ...acc, attack: acc.attack + 1 };
-        case AttackDieFace.TWO_SWORDS_AND_SKULL:
-          return { ...acc, attack: acc.attack + 2, kill: acc.kill + 1 };
-        default:
-          throw new Error(`Unknown die face ${face}`);
-      }
-    },
-    { attack: 0, kill: 0 }
-  );
-  return { ...raw, attack: Math.floor(raw.attack) };
-}
+export function toAttackResult(faces: AttackDieFace[]): AttackResult {}
 
 /** The Oath defense (blue) die. */

[Killed] BlockStatement
oath-odds/src/oath/index.ts:23:49
  */
 export function toAttackResult(faces: AttackDieFace[]): AttackResult {
   const raw = faces.sort().reduce(
-    (acc: AttackResult, face: AttackDieFace) => {
-      switch (face) {
-        case AttackDieFace.HOLLOW_SWORD:
-          return { ...acc, attack: acc.attack + 0.5 };
-        case AttackDieFace.SWORD:
-          return { ...acc, attack: acc.attack + 1 };
-        case AttackDieFace.TWO_SWORDS_AND_SKULL:
-          return { ...acc, attack: acc.attack + 2, kill: acc.kill + 1 };
-        default:
-          throw new Error(`Unknown die face ${face}`);
-      }
-    },
+    (acc: AttackResult, face: AttackDieFace) => {},
     { attack: 0, kill: 0 }
   );

[Killed] ConditionalExpression
oath-odds/src/oath/index.ts:25:9
   const raw = faces.sort().reduce(
     (acc: AttackResult, face: AttackDieFace) => {
       switch (face) {
-        case AttackDieFace.HOLLOW_SWORD:
-          return { ...acc, attack: acc.attack + 0.5 };
+        case AttackDieFace.HOLLOW_SWORD:
         case AttackDieFace.SWORD:
           return { ...acc, attack: acc.attack + 1 };

[Killed] ArithmeticOperator
oath-odds/src/oath/index.ts:26:36
     (acc: AttackResult, face: AttackDieFace) => {
       switch (face) {
         case AttackDieFace.HOLLOW_SWORD:
-          return { ...acc, attack: acc.attack + 0.5 };
+          return { ...acc, attack: acc.attack - 0.5 };
         case AttackDieFace.SWORD:
           return { ...acc, attack: acc.attack + 1 };

[Killed] ConditionalExpression
oath-odds/src/oath/index.ts:27:9
       switch (face) {
         case AttackDieFace.HOLLOW_SWORD:
           return { ...acc, attack: acc.attack + 0.5 };
-        case AttackDieFace.SWORD:
-          return { ...acc, attack: acc.attack + 1 };
+        case AttackDieFace.SWORD:
         case AttackDieFace.TWO_SWORDS_AND_SKULL:
           return { ...acc, attack: acc.attack + 2, kill: acc.kill + 1 };

[Killed] ArithmeticOperator
oath-odds/src/oath/index.ts:28:36
         case AttackDieFace.HOLLOW_SWORD:
           return { ...acc, attack: acc.attack + 0.5 };
         case AttackDieFace.SWORD:
-          return { ...acc, attack: acc.attack + 1 };
+          return { ...acc, attack: acc.attack - 1 };
         case AttackDieFace.TWO_SWORDS_AND_SKULL:
           return { ...acc, attack: acc.attack + 2, kill: acc.kill + 1 };

[Killed] ConditionalExpression
oath-odds/src/oath/index.ts:29:9
           return { ...acc, attack: acc.attack + 0.5 };
         case AttackDieFace.SWORD:
           return { ...acc, attack: acc.attack + 1 };
-        case AttackDieFace.TWO_SWORDS_AND_SKULL:
-          return { ...acc, attack: acc.attack + 2, kill: acc.kill + 1 };
+        case AttackDieFace.TWO_SWORDS_AND_SKULL:
         default:
           throw new Error(`Unknown die face ${face}`);

[Killed] ArithmeticOperator
oath-odds/src/oath/index.ts:30:58
         case AttackDieFace.SWORD:
           return { ...acc, attack: acc.attack + 1 };
         case AttackDieFace.TWO_SWORDS_AND_SKULL:
-          return { ...acc, attack: acc.attack + 2, kill: acc.kill + 1 };
+          return { ...acc, attack: acc.attack + 2, kill: acc.kill - 1 };
         default:
           throw new Error(`Unknown die face ${face}`);

[Killed] ArithmeticOperator
oath-odds/src/oath/index.ts:30:36
         case AttackDieFace.SWORD:
           return { ...acc, attack: acc.attack + 1 };
         case AttackDieFace.TWO_SWORDS_AND_SKULL:
-          return { ...acc, attack: acc.attack + 2, kill: acc.kill + 1 };
+          return { ...acc, attack: acc.attack - 2, kill: acc.kill + 1 };
         default:
           throw new Error(`Unknown die face ${face}`);

[Survived] ConditionalExpression
oath-odds/src/oath/index.ts:31:9
           return { ...acc, attack: acc.attack + 1 };
         case AttackDieFace.TWO_SWORDS_AND_SKULL:
           return { ...acc, attack: acc.attack + 2, kill: acc.kill + 1 };
-        default:
-          throw new Error(`Unknown die face ${face}`);
+        default:
       }
     },

[Killed] ArrayDeclaration
oath-odds/src/oath/index.ts:41:60
 }
 
 /** The Oath defense (blue) die. */
-export const DefenseDie = new RandomDevice<DefenseDieFace>([
-  [DefenseDieFace.BLANK, new Fraction(2, 6)],
-  [DefenseDieFace.SHIELD, new Fraction(2, 6)],
-  [DefenseDieFace.TWO_SHIELDS, new Fraction(1, 6)],
-  [DefenseDieFace.DOUBLE, new Fraction(1, 6)],
-]);
+export const DefenseDie = new RandomDevice<DefenseDieFace>([]);
 
 /**

[Killed] ArrayDeclaration
oath-odds/src/oath/index.ts:44:3
 export const DefenseDie = new RandomDevice<DefenseDieFace>([
   [DefenseDieFace.BLANK, new Fraction(2, 6)],
   [DefenseDieFace.SHIELD, new Fraction(2, 6)],
-  [DefenseDieFace.TWO_SHIELDS, new Fraction(1, 6)],
+  [],
   [DefenseDieFace.DOUBLE, new Fraction(1, 6)],
 ]);

[Killed] BlockStatement
oath-odds/src/oath/index.ts:56:73
  * @returns {CampaignResult}
  *   The defense roll result after adding all die faces.
  */
-export function toDefenseResult(faces: DefenseDieFace[]): DefenseResult {
-  return faces.sort().reduce(
-    (acc: DefenseResult, face: DefenseDieFace) => {
-      switch (face) {
-        case DefenseDieFace.BLANK:
-          return acc;
-        case DefenseDieFace.SHIELD:
-          return { ...acc, defense: acc.defense + 1 };
-        case DefenseDieFace.TWO_SHIELDS:
-          return { ...acc, defense: acc.defense + 2 };
-        case DefenseDieFace.DOUBLE:
-          return { ...acc, defense: acc.defense * 2 };
-        default:
-          throw new Error(`Unknown die face ${face}`);
-      }
-    },
-    { defense: 0 }
-  );
-}
+export function toDefenseResult(faces: DefenseDieFace[]): DefenseResult {}
 
 export * from "./AttackDieFace";

[Killed] BlockStatement
oath-odds/src/oath/index.ts:58:51
  */
 export function toDefenseResult(faces: DefenseDieFace[]): DefenseResult {
   return faces.sort().reduce(
-    (acc: DefenseResult, face: DefenseDieFace) => {
-      switch (face) {
-        case DefenseDieFace.BLANK:
-          return acc;
-        case DefenseDieFace.SHIELD:
-          return { ...acc, defense: acc.defense + 1 };
-        case DefenseDieFace.TWO_SHIELDS:
-          return { ...acc, defense: acc.defense + 2 };
-        case DefenseDieFace.DOUBLE:
-          return { ...acc, defense: acc.defense * 2 };
-        default:
-          throw new Error(`Unknown die face ${face}`);
-      }
-    },
+    (acc: DefenseResult, face: DefenseDieFace) => {},
     { defense: 0 }
   );

[Killed] ConditionalExpression
oath-odds/src/oath/index.ts:60:9
   return faces.sort().reduce(
     (acc: DefenseResult, face: DefenseDieFace) => {
       switch (face) {
-        case DefenseDieFace.BLANK:
-          return acc;
+        case DefenseDieFace.BLANK:
         case DefenseDieFace.SHIELD:
           return { ...acc, defense: acc.defense + 1 };

[Killed] ConditionalExpression
oath-odds/src/oath/index.ts:62:9
       switch (face) {
         case DefenseDieFace.BLANK:
           return acc;
-        case DefenseDieFace.SHIELD:
-          return { ...acc, defense: acc.defense + 1 };
+        case DefenseDieFace.SHIELD:
         case DefenseDieFace.TWO_SHIELDS:
           return { ...acc, defense: acc.defense + 2 };

[Killed] ArithmeticOperator
oath-odds/src/oath/index.ts:63:37
         case DefenseDieFace.BLANK:
           return acc;
         case DefenseDieFace.SHIELD:
-          return { ...acc, defense: acc.defense + 1 };
+          return { ...acc, defense: acc.defense - 1 };
         case DefenseDieFace.TWO_SHIELDS:
           return { ...acc, defense: acc.defense + 2 };

[Killed] ObjectLiteral
oath-odds/src/oath/index.ts:63:18
         case DefenseDieFace.BLANK:
           return acc;
         case DefenseDieFace.SHIELD:
-          return { ...acc, defense: acc.defense + 1 };
+          return {};
         case DefenseDieFace.TWO_SHIELDS:
           return { ...acc, defense: acc.defense + 2 };

[Killed] ConditionalExpression
oath-odds/src/oath/index.ts:64:9
           return acc;
         case DefenseDieFace.SHIELD:
           return { ...acc, defense: acc.defense + 1 };
-        case DefenseDieFace.TWO_SHIELDS:
-          return { ...acc, defense: acc.defense + 2 };
+        case DefenseDieFace.TWO_SHIELDS:
         case DefenseDieFace.DOUBLE:
           return { ...acc, defense: acc.defense * 2 };

[Killed] ArithmeticOperator
oath-odds/src/oath/index.ts:65:37
         case DefenseDieFace.SHIELD:
           return { ...acc, defense: acc.defense + 1 };
         case DefenseDieFace.TWO_SHIELDS:
-          return { ...acc, defense: acc.defense + 2 };
+          return { ...acc, defense: acc.defense - 2 };
         case DefenseDieFace.DOUBLE:
           return { ...acc, defense: acc.defense * 2 };

[Killed] ConditionalExpression
oath-odds/src/oath/index.ts:66:9
           return { ...acc, defense: acc.defense + 1 };
         case DefenseDieFace.TWO_SHIELDS:
           return { ...acc, defense: acc.defense + 2 };
-        case DefenseDieFace.DOUBLE:
-          return { ...acc, defense: acc.defense * 2 };
+        case DefenseDieFace.DOUBLE:
         default:
           throw new Error(`Unknown die face ${face}`);

[Killed] ArithmeticOperator
oath-odds/src/oath/index.ts:67:37
         case DefenseDieFace.TWO_SHIELDS:
           return { ...acc, defense: acc.defense + 2 };
         case DefenseDieFace.DOUBLE:
-          return { ...acc, defense: acc.defense * 2 };
+          return { ...acc, defense: acc.defense / 2 };
         default:
           throw new Error(`Unknown die face ${face}`);

[Killed] ConditionalExpression
oath-odds/src/oath/index.ts:68:9
           return { ...acc, defense: acc.defense + 2 };
         case DefenseDieFace.DOUBLE:
           return { ...acc, defense: acc.defense * 2 };
-        default:
-          throw new Error(`Unknown die face ${face}`);
+        default:
       }
     },
