[Killed] BlockStatement
oath-odds/src/utils/arrays.ts:11:47
  * @returns {T[]}
  *   A flattened array.
  */
-export function flatten<T>(elems: T[][]): T[] {
-  return [].concat.apply([], elems);
-}
+export function flatten<T>(elems: T[][]): T[] {}
 
 /**

[Survived] ArrayDeclaration
oath-odds/src/utils/arrays.ts:12:10
  *   A flattened array.
  */
 export function flatten<T>(elems: T[][]): T[] {
-  return [].concat.apply([], elems);
+  return ["Stryker was here"].concat.apply([], elems);
 }
 

[Killed] BlockStatement
oath-odds/src/utils/arrays.ts:27:57
  * @return {boolean}
  *   True if `a` and `b` contains the same values in the same order.
  */
-export function arrayEquals<T>(a: T[], b: T[]): boolean {
-  if (!(Array.isArray(a) && Array.isArray(b))) {
-    return false;
-  }
-
-  if (a.length !== b.length) {
-    return false;
-  }
-
-  for (let i = 0; i < a.length; i++) {
-    if (a[i] !== b[i]) {
-      return false;
-    }
-  }
-
-  return true;
-}
+export function arrayEquals<T>(a: T[], b: T[]): boolean {}
 
 /**

[Killed] BooleanLiteral
oath-odds/src/utils/arrays.ts:28:7
  *   True if `a` and `b` contains the same values in the same order.
  */
 export function arrayEquals<T>(a: T[], b: T[]): boolean {
-  if (!(Array.isArray(a) && Array.isArray(b))) {
+  if (Array.isArray(a) && Array.isArray(b)) {
     return false;
   }

[Killed] ConditionalExpression
oath-odds/src/utils/arrays.ts:28:9
  *   True if `a` and `b` contains the same values in the same order.
  */
 export function arrayEquals<T>(a: T[], b: T[]): boolean {
-  if (!(Array.isArray(a) && Array.isArray(b))) {
+  if (!(false)) {
     return false;
   }

[Killed] BooleanLiteral
oath-odds/src/utils/arrays.ts:29:12
  */
 export function arrayEquals<T>(a: T[], b: T[]): boolean {
   if (!(Array.isArray(a) && Array.isArray(b))) {
-    return false;
+    return true;
   }
 

[Killed] EqualityOperator
oath-odds/src/utils/arrays.ts:32:7
     return false;
   }
 
-  if (a.length !== b.length) {
+  if (a.length === b.length) {
     return false;
   }

[Killed] ConditionalExpression
oath-odds/src/utils/arrays.ts:32:7
     return false;
   }
 
-  if (a.length !== b.length) {
+  if (true) {
     return false;
   }

[Killed] BooleanLiteral
oath-odds/src/utils/arrays.ts:33:12
   }
 
   if (a.length !== b.length) {
-    return false;
+    return true;
   }
 

[Killed] BlockStatement
oath-odds/src/utils/arrays.ts:36:38
     return false;
   }
 
-  for (let i = 0; i < a.length; i++) {
-    if (a[i] !== b[i]) {
-      return false;
-    }
-  }
+  for (let i = 0; i < a.length; i++) {}
 
   return true;

[Killed] ConditionalExpression
oath-odds/src/utils/arrays.ts:36:19
     return false;
   }
 
-  for (let i = 0; i < a.length; i++) {
+  for (let i = 0; false; i++) {
     if (a[i] !== b[i]) {
       return false;

[Killed] BlockStatement
oath-odds/src/utils/arrays.ts:37:24
   }
 
   for (let i = 0; i < a.length; i++) {
-    if (a[i] !== b[i]) {
-      return false;
-    }
+    if (a[i] !== b[i]) {}
   }
 

[Killed] EqualityOperator
oath-odds/src/utils/arrays.ts:37:9
   }
 
   for (let i = 0; i < a.length; i++) {
-    if (a[i] !== b[i]) {
+    if (a[i] === b[i]) {
       return false;
     }

[Killed] BooleanLiteral
oath-odds/src/utils/arrays.ts:38:14
 
   for (let i = 0; i < a.length; i++) {
     if (a[i] !== b[i]) {
-      return false;
+      return true;
     }
   }

[Killed] BlockStatement
oath-odds/src/utils/arrays.ts:59:67
  * @return {T[]}
  *   A new array with the element replaced.
  */
-export function replace<T>(elems: T[], idx: number, elem: T): T[] {
-  if (idx >= 0 && idx < elems.length) {
-    return [...elems.slice(0, idx), elem, ...elems.slice(idx + 1)];
-  } else {
-    return [...elems];
-  }
-}
+export function replace<T>(elems: T[], idx: number, elem: T): T[] {}
 

[Killed] EqualityOperator
oath-odds/src/utils/arrays.ts:60:7
  *   A new array with the element replaced.
  */
 export function replace<T>(elems: T[], idx: number, elem: T): T[] {
-  if (idx >= 0 && idx < elems.length) {
+  if (idx < 0 && idx < elems.length) {
     return [...elems.slice(0, idx), elem, ...elems.slice(idx + 1)];
   } else {

[Killed] EqualityOperator
oath-odds/src/utils/arrays.ts:60:7
  *   A new array with the element replaced.
  */
 export function replace<T>(elems: T[], idx: number, elem: T): T[] {
-  if (idx >= 0 && idx < elems.length) {
+  if (idx > 0 && idx < elems.length) {
     return [...elems.slice(0, idx), elem, ...elems.slice(idx + 1)];
   } else {

[Killed] ArithmeticOperator
oath-odds/src/utils/arrays.ts:61:58
  */
 export function replace<T>(elems: T[], idx: number, elem: T): T[] {
   if (idx >= 0 && idx < elems.length) {
-    return [...elems.slice(0, idx), elem, ...elems.slice(idx + 1)];
+    return [...elems.slice(0, idx), elem, ...elems.slice(idx - 1)];
   } else {
     return [...elems];

[Killed] BlockStatement
oath-odds/src/utils/arrays.ts:62:10
 export function replace<T>(elems: T[], idx: number, elem: T): T[] {
   if (idx >= 0 && idx < elems.length) {
     return [...elems.slice(0, idx), elem, ...elems.slice(idx + 1)];
-  } else {
-    return [...elems];
-  }
+  } else {}
 }
 
